In [1]:
import numpy as np
import pandas as pd

In [5]:
d1 = {'A':['A1','A2','A3','A4','A5'],'B':['B1','B2','B3','B4','B5']}

In [6]:
d2 = {'C':['C1','C2','C3','C4','C5'],'D':['D1','D2','D3','D4','D5']}

In [7]:
d1

{'A': ['A1', 'A2', 'A3', 'A4', 'A5'], 'B': ['B1', 'B2', 'B3', 'B4', 'B5']}

In [15]:
one = pd.DataFrame(data = d1,index=[1,2,3,4,5])
two = pd.DataFrame(data = d2,index=[1,2,3,4,5])

In [16]:
one

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4
5  A5  B5

In [23]:
pd.concat([one,two],axis=0,keys=['s1','s2'])

        A    B    C    D
s1 1   A1   B1  NaN  NaN
   2   A2   B2  NaN  NaN
   3   A3   B3  NaN  NaN
   4   A4   B4  NaN  NaN
   5   A5   B5  NaN  NaN
s2 1  NaN  NaN   C1   D1
   2  NaN  NaN   C2   D2
   3  NaN  NaN   C3   D3
   4  NaN  NaN   C4   D4
   5  NaN  NaN   C5   D5

In [24]:
two.columns=['A','B']

In [25]:
two

    A   B
1  C1  D1
2  C2  D2
3  C3  D3
4  C4  D4
5  C5  D5

In [28]:
df = pd.concat([one, two])

In [29]:
df.index = range(len(df))

In [30]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [31]:
df

    A   B
0  A1  B1
1  A2  B2
2  A3  B3
3  A4  B4
4  A5  B5
5  C1  D1
6  C2  D2
7  C3  D3
8  C4  D4
9  C5  D5

In [51]:
registrations = pd.DataFrame({'reg_id':[1,2,3,4],'name':['Andrew','Bob','Claire','David']})
logins = pd.DataFrame({'log_id':[1,2,3,4],'name':['Xavier','Andrew','Yolanda','Bob']})

In [50]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [52]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4      Bob

In [54]:
pd.merge(registrations,logins,how='inner',on='name')

   reg_id    name  log_id
0       1  Andrew       2
1       2     Bob       4

In [55]:
registrations

   reg_id    name
0       1  Andrew
1       2     Bob
2       3  Claire
3       4   David

In [56]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4      Bob

In [62]:
pd.merge(left = registrations,right = logins,how='left',on='name')

   reg_id    name  log_id
0       1  Andrew     2.0
1       2     Bob     4.0
2       3  Claire     NaN
3       4   David     NaN

In [65]:


pd.merge(left = registrations,right = logins,how='right',on='name',sort=False)

   reg_id     name  log_id
0     NaN   Xavier       1
1     1.0   Andrew       2
2     NaN  Yolanda       3
3     2.0      Bob       4

In [66]:
pd.merge(left = registrations,right = logins,how='outer',on='name')

   reg_id     name  log_id
0     1.0   Andrew     2.0
1     2.0      Bob     4.0
2     3.0   Claire     NaN
3     4.0    David     NaN
4     NaN   Xavier     1.0
5     NaN  Yolanda     3.0

In [69]:
registrations=registrations.set_index('name')

In [70]:
registrations

        reg_id
name
Andrew       1
Bob          2
Claire       3
David        4

In [71]:
pd.merge(registrations,logins,left_index=True,right_on='name')

   reg_id  log_id    name
1       1       2  Andrew
3       2       4     Bob

In [72]:
registrations=registrations.reset_index()

In [73]:
registrations

     name  reg_id
0  Andrew       1
1     Bob       2
2  Claire       3
3   David       4